module2/case-study-1-assignment1/tests/case-study-1/cs1-load-write-2clients-in-memory-v1.yml
config:
  target: 'http://localhost:3000' # Replace with your application's URL if different
  phases:
    - duration: 15 # Run the test for 30 seconds
      arrivalRate: 2 # Simulate 10 new virtual users arriving per second
  defaults:
    headers:
      Content-Type: 'application/json' # Assuming your API uses JSON

scenarios:
  - name: Load Test - insert new record
    flow:
      - post:
          url: '/api/products'
          json:
            name: "test product"
            price: '100'